# Concatenating Tables with Set-Like Operations

One of the two way of combining two tables is to stack one table on top of the other.  When stacking two tables on top of one another, we need to decide

1. If we combine columns based on position or name (and if combining by name, what do we do with mismatches?)
2. How to decide which rows to keep.  In this case, we will take some guidance from SQL clauses.

## Three Types of Operations

* **Union:** Keeps rows from either table.
* **Intersection:** Only keeps common columns
* **Set Difference/Except:** Keep rows from the left table *except* those in the right table.

## Set Operations in Action 

<img src="./img/table_verbs_set.gif" width=800>

## All Operations Match by Position

All operations

* Match columns by position
* Require same number/type of columns

## Distinct Versus All

* **UNION/INTERSECT/SET DIFFERENE** are **DISTINCT**
    * Only keeps distinct rows, removing duplicates.
* **UNION ALL/INTERSECT ALL/SET DIFFERENCE ALL**
    * Keeps duplicate rows

In [1]:
import pandas as pd
from dfply import *

In [2]:
sales_may = pd.read_csv('./data/auto_sales_may.csv')
sales_may

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck
0           0         Ann       22     18   15     12
1           1         Bob       20     14    6     24
2           2     Yolanda       19     10   28     17
3           3      Xerxes       11     27   17      9

In [3]:
sales_apr = pd.read_csv('./data/auto_sales_apr.csv')
sales_apr

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck
0           0         Ann       22     18   15     12
1           1         Bob       19     12   17     20
2           2     Yolanda       19      8   32     15
3           3      Xerxes       12     23   18      9

## Unions with `dfply`

Use `left_table >> union(right_table)`

In [4]:
sales_may >> union(sales_apr)

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck
0           0         Ann       22     18   15     12
1           1         Bob       20     14    6     24
2           2     Yolanda       19     10   28     17
3           3      Xerxes       11     27   17      9
1           1         Bob       19     12   17     20
2           2     Yolanda       19      8   32     15
3           3      Xerxes       12     23   18      9

## `dfply.union` is distinct

Since Ann have the same sales each month, her row only included one row.  Note that we can use `keep='last'` to `keep='first'` to determine which row is kept.

In [5]:
sales_may >> union(sales_apr, keep='last')

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck
1           1         Bob       20     14    6     24
2           2     Yolanda       19     10   28     17
3           3      Xerxes       11     27   17      9
0           0         Ann       22     18   15     12
1           1         Bob       19     12   17     20
2           2     Yolanda       19      8   32     15
3           3      Xerxes       12     23   18      9

In [6]:
sales_may >> union(sales_apr, keep='first')

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck
0           0         Ann       22     18   15     12
1           1         Bob       20     14    6     24
2           2     Yolanda       19     10   28     17
3           3      Xerxes       11     27   17      9
1           1         Bob       19     12   17     20
2           2     Yolanda       19      8   32     15
3           3      Xerxes       12     23   18      9

## Making `union_all`

We can use `pd.concat` to perform a `UNION ALL`

In [8]:
from more_dfply import union_all
sales_may >> union_all(sales_apr)

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck
0           0         Ann       22     18   15     12
1           1         Bob       20     14    6     24
2           2     Yolanda       19     10   28     17
3           3      Xerxes       11     27   17      9
4           0         Ann       22     18   15     12
5           1         Bob       19     12   17     20
6           2     Yolanda       19      8   32     15
7           3      Xerxes       12     23   18      9

## Adding a month column

Another way to keep both of Ann's sales rows is adding a month column (which we should probably do anyway).

In [9]:
sales_may >> mutate(month = 'May') >> union(sales_apr >> mutate(month = 'April'))

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck  month
0           0         Ann       22     18   15     12    May
1           1         Bob       20     14    6     24    May
2           2     Yolanda       19     10   28     17    May
3           3      Xerxes       11     27   17      9    May
0           0         Ann       22     18   15     12  April
1           1         Bob       19     12   17     20  April
2           2     Yolanda       19      8   32     15  April
3           3      Xerxes       12     23   18      9  April

## Finding common rows with `dfply.intersect`

In [10]:
sales_may >> intersect(sales_apr)

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck
0           0         Ann       22     18   15     12

## Finding rows unique to the left table.

Use `left_table >> dfply.set_diff(right_table)`

In [11]:
sales_may >> set_diff(sales_apr)

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck
1           1         Bob       20     14    6     24
2           2     Yolanda       19     10   28     17
3           3      Xerxes       11     27   17      9

## <font color="red"> Exercise 1 </font>

In the data folder, you will find 6 files that contain a sample 100,000 rows from the uber data for the month apr14-sep14.  Perform the following tasks:

1. Use `glob` to get all 6 file paths.
2. Use a regular expression to create a `lambda` function that pulls the month from the files.
3. Read the 6 data frames into a `dict` with keys equal to the month name and values containing the corresponding data frame.
4. Write a helper function that adds a month column each dictionary.  Use a dictionary comprehension to apply this helper to each `df`.
5. Use the accumulator pattern and `dfply.union` to combine these 6 data frames into one combined `df`
6. Inspect the head and shape of the resulting `df`

In [22]:
# Your code here

import glob

glob.glob("./data/uber*.csv")

['./data/uber-raw-data-jun14-sample.csv',
 './data/uber-raw-data-may14-sample.csv',
 './data/uber-raw-data-aug14-sample.csv',
 './data/uber-raw-data-sep14-sample.csv',
 './data/uber-raw-data-apr14-sample.csv',
 './data/uber-raw-data-jul14-sample.csv']

In [34]:
monthpuller =  lambda x: re.search('([a-z]+)\d\d', x)[0]

In [49]:
uber_months = list(map(monthpuller, glob.glob("./data/uber*.csv")))

uber_months[5]

'jul14'

In [44]:
thisdict = {
 uber_months[0] : pd.read_csv('./data/uber-raw-data-jun14-sample.csv'),
 uber_months[1] : pd.read_csv('./data/uber-raw-data-may14-sample.csv'),
 uber_months[2] : pd.read_csv('./data/uber-raw-data-aug14-sample.csv'),
 uber_months[3] : pd.read_csv('./data/uber-raw-data-sep14-sample.csv'),
 uber_months[4] : pd.read_csv('./data/uber-raw-data-apr14-sample.csv'),
 uber_months[5] : pd.read_csv('./data/uber-raw-data-jul14-sample.csv')
}

In [38]:
month_columns = {'{0}'.format(base): value
               for value in (uber_months)}

In [ ]:
#Reminder: come back and clean this up later after finishing Project 1

In [50]:
uber_june = pd.read_csv('./data/uber-raw-data-jun14-sample.csv')

uber_may = pd.read_csv('./data/uber-raw-data-may14-sample.csv')

uber_aug = pd.read_csv('./data/uber-raw-data-aug14-sample.csv')

uber_apr = pd.read_csv('./data/uber-raw-data-apr14-sample.csv')

uber_jul = pd.read_csv('./data/uber-raw-data-jul14-sample.csv')

uber_sep = pd.read_csv('./data/uber-raw-data-sep14-sample.csv')

In [58]:
Unioned_ubers = uber_june >> mutate(month = 'June') >> union_all(uber_may >> mutate(month = 'May')) >> union_all(uber_aug >> mutate(month = 'August')) >> union_all(uber_apr >> mutate(month = 'April')) >> union_all(uber_jul >> mutate(month = 'July')) >> union_all(uber_sep >> mutate(month = 'September'))

In [60]:
Unioned_ubers.head()

            Date/Time      Lat      Lon    Base month
0  6/19/2014 16:49:00  40.7568 -73.9701  B02682  June
1  6/12/2014 21:25:00  40.6463 -73.7768  B02598  June
2  6/15/2014 22:23:00  40.7205 -73.9575  B02512  June
3  6/14/2014 20:34:00  40.7639 -73.9624  B02617  June
4  6/13/2014 14:36:00  40.7665 -73.9667  B02598  June

In [94]:
#pattern

def Uber_handler(x):
    
    monthpuller =  lambda string: re.search('([a-z]+)\d\d', string)[0]

    output_dataframe = pd.DataFrame(columns = ['Date/Time', 'Lat', 'Lon', 'Base', 'month'])


    for obj in x:
        tempdf = pd.read_csv(obj)
        tempdf_mutated = tempdf >> mutate(month = monthpuller(obj) )
        output_dataframe = output_dataframe >> union_all(tempdf_mutated)

    return output_dataframe

In [95]:
output = Uber_handler(glob.glob("./data/uber*.csv"))

In [96]:
output

                 Date/Time      Lat      Lon    Base  month
0       6/19/2014 16:49:00  40.7568 -73.9701  B02682  jun14
1       6/12/2014 21:25:00  40.6463 -73.7768  B02598  jun14
2       6/15/2014 22:23:00  40.7205 -73.9575  B02512  jun14
3       6/14/2014 20:34:00  40.7639 -73.9624  B02617  jun14
4       6/13/2014 14:36:00  40.7665 -73.9667  B02598  jun14
...                    ...      ...      ...     ...    ...
599995    7/9/2014 7:17:00  40.7329 -73.9794  B02617  jul14
599996  7/24/2014 13:34:00  40.6713 -73.9846  B02682  jul14
599997   7/3/2014 10:06:00  40.7623 -73.9660  B02598  jul14
599998   7/8/2014 22:21:00  40.7670 -73.9171  B02617  jul14
599999  7/14/2014 17:01:00  40.7331 -73.9948  B02682  jul14

[600000 rows x 5 columns]